-- Сценарий создания базы данных students для лабораторной работы
CREATE DATABASE students;
GO

USE students;

-- Создание таблицы Предметы
CREATE TABLE [Предметы](
	[Код предмета] [bigint] IDENTITY(1,1) NOT NULL,
	[Наименование предмета] [varchar](50) NULL,
	[Описание предмета] [varchar](max) NULL,
 CONSTRAINT [PK_Предметы] PRIMARY KEY CLUSTERED 
(
	[Код предмета] ASC
)WITH (PAD_INDEX  = OFF, STATISTICS_NORECOMPUTE  = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS  = ON, ALLOW_PAGE_LOCKS  = ON) ON [PRIMARY]
) ON [PRIMARY] TEXTIMAGE_ON [PRIMARY];

-- Заполнение таблицы Предметы
INSERT INTO [Предметы]
           ([Наименование предмета]
           ,[Описание предмета])
     VALUES
           ('Операционные системы'  , ' Microsoft Windows Vista'),
           ('Офисные пакеты'  , ' Microsoft Office 2007'),
           ('Базы данных'  , ' Microsoft Access 2007'),
           ('Языки программирования'  , ' Microsoft Visual Studio 2008'),
           ('Проектирование информационных систем'  , ' Microsoft SQL Server 2008');

-- Создание таблицы Специальности
CREATE TABLE [Специальности](
	[Код специальности] [bigint] IDENTITY(1,1) NOT NULL,
	[Наименование специальности] [varchar](50) NULL,
	[Описание специальности] [varchar](max) NULL,
 CONSTRAINT [PK_Специальности] PRIMARY KEY CLUSTERED 
(
	[Код специальности] ASC
)WITH (PAD_INDEX  = OFF, STATISTICS_NORECOMPUTE  = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS  = ON, ALLOW_PAGE_LOCKS  = ON) ON [PRIMARY]
) ON [PRIMARY] TEXTIMAGE_ON [PRIMARY];

-- Заполнение таблицы Специальности
INSERT INTO [Специальности]
           ([Наименование специальности]
           ,[Описание специальности])
     VALUES
 ( 'ММ', 'Математические методы'),
 ('ПИ', 'Прикладная информатика'),
 ('СТ', 'Статистика'),
 ('МО', 'Менеджмент организаций'),
 ('БУ', 'Бухгалтерский учёт');

-- Создание таблицы Студенты
CREATE TABLE [Студенты](
	[Код студента] [bigint] IDENTITY(1,1) NOT NULL,
	[ФИО] [varchar](50) NULL,
	[Пол] [varchar](10) NULL,
	[Дата рождения] [date] NULL,
	[Родители] [varchar](50) NULL,
	[Адрес] [varchar](max) NULL,
	[Телефон] [varchar](15) NULL,
	[Паспортные данные] [varchar](max) NULL,
	[Номер зачётки] [bigint] NULL,
	[Дата поступления] [date] NULL,
	[Группа] [varchar](10) NULL,
	[Курс] [tinyint] NULL,
	[Код специальности] [bigint] NULL,
	[Очная форма обучения] [bit] NULL,
 CONSTRAINT [PK_Студенты] PRIMARY KEY CLUSTERED 
(
	[Код студента] ASC
)WITH (PAD_INDEX  = OFF, STATISTICS_NORECOMPUTE  = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS  = ON, ALLOW_PAGE_LOCKS  = ON) ON [PRIMARY]
) ON [PRIMARY] TEXTIMAGE_ON [PRIMARY];

-- Заполнение таблицы Студенты (замена "Familia" на "Bashkirov")
INSERT INTO [Студенты]
           ([ФИО]
           ,[Пол]
           ,[Дата рождения]
           ,[Родители]
           ,[Адрес]
           ,[Телефон]
           ,[Паспортные данные]
           ,[Номер зачётки]
           ,[Дата поступления]
           ,[Группа]
           ,[Курс]
           ,[Код специальности]
           ,[Очная форма обучения])
     VALUES
('Иванов А.И.', 'Мужской', '1983-12-12', 'Отец, Мать', 'Москва', '+74957895674', '8567-567543', 13245, '2007-01-09', 'ММ11', 1, 1, 1),
 ('Петрова И.И.', 'Женский', '1982-01-11', 'Мать', 'Москва', '+74957889876', '4567-765432', 34563, '2006-01-08', 'ПИ21', 2, 2, 0),
 ('Мухин М.А.', 'Мужской', '1982-05-14', 'Отец', 'Самара', '+78462875690', '5438-098787', 56732, '2006-05-07', 'СТ22', 2, 3, 0),
 ('Сидорова В.К.', 'Женский', '1981-09-27', 'Нет', 'Саратов', '+79027868909', '1287-987509', 27543, '2005-06-23', 'МО31', 3, 4, 1),
 ('Кожевников А.А.', 'Мужской', '1981-12-04', 'Мать', 'Казань', '+79168563476', '2312-675468', 34217, '2005-07-21', 'БУ33', 3, 5, 1),
 ('Пальчикова Н.Е.', 'Женский', '1983-02-09', 'Отец, Мать', 'Челябинск', '+74569098723', '8743-856780', 43278, '2007-01-08', 'ММ12', 1, 1, 0),
 ('Царегородцев Е.В.', 'Мужской', '1980-02-17', 'Отец', 'Самара', '+78462234769', '6543-834521', 43765, '2004-04-07', 'ПИ41', 4, 2, 1),
 ('Баранова Г.В.', 'Женский', '1980-09-07', 'Отец, Мать', 'Чебоксары', '+79027874638', '2133-896567', 10387, '2004-09-08', 'СТ42', 4, 3, 0),
 ('Леухин П.Г.', 'Мужской', '1979-02-26', 'Нет', 'Казань', '+79067453678', '2769-634904', 67348, '2003-07-23', 'МО51', 5, 4, 1),
('Николаева А.П.', 'Женский', '1979-03-17', 'Мать', 'Саратов', '+78546456432', '3256-490932', 45287, '2003-06-21', 'БУ53', 5, 5, 0) ,
('Башкиров Д.В.', 'Мужской', '1950-05-05', 'Отец', 'Алатырь', '+78546456432', '3256-490932', 45287, '2003-06-21', 'БУ53', 5, 5, 0);

-- Создание таблицы Оценки
CREATE TABLE [Оценки](
	[Код студента] [bigint] NULL,
	[Дата экзамена 1] [date] NULL,
	[Код предмета 1] [bigint] NULL,
	[Оценка 1] [tinyint] NULL,
	[Дата экзамена 2] [date] NULL,
	[Код предмета 2] [bigint] NULL,
	[Оценка 2] [tinyint] NULL,
	[Дата экзамена 3] [date] NULL,
	[Код предмета 3] [bigint] NULL,
	[Оценка 3] [tinyint] NULL,
	[Средний балл] [real] NULL
) ON [PRIMARY];

GO

-- Создание внешних ключей для таблицы Оценки
ALTER TABLE [Оценки]  WITH CHECK ADD  CONSTRAINT [FK_Оценки_Предметы] FOREIGN KEY([Код предмета 1])
REFERENCES [Предметы] ([Код предмета]);
GO

ALTER TABLE [Оценки] CHECK CONSTRAINT [FK_Оценки_Предметы];
GO

ALTER TABLE [Оценки]  WITH CHECK ADD  CONSTRAINT [FK_Оценки_Предметы1] FOREIGN KEY([Код предмета 2])
REFERENCES [Предметы] ([Код предмета]);
GO

ALTER TABLE [Оценки] CHECK CONSTRAINT [FK_Оценки_Предметы1];
GO

ALTER TABLE [Оценки]  WITH CHECK ADD  CONSTRAINT [FK_Оценки_Предметы2] FOREIGN KEY([Код предмета 3])
REFERENCES [Предметы] ([Код предмета]);
GO

ALTER TABLE [Оценки] CHECK CONSTRAINT [FK_Оценки_Предметы2];
GO

ALTER TABLE [Оценки]  WITH CHECK ADD  CONSTRAINT [FK_Оценки_Студенты] FOREIGN KEY([Код студента])
REFERENCES [Студенты] ([Код студента]);
GO

ALTER TABLE [Оценки] CHECK CONSTRAINT [FK_Оценки_Студенты];
GO

-- Заполнение таблицы Оценки
INSERT INTO [Оценки]
           ([Код студента]
           ,[Дата экзамена 1]
           ,[Код предмета 1]
           ,[Оценка 1]
           ,[Дата экзамена 2]
           ,[Код предмета 2]
           ,[Оценка 2]
           ,[Дата экзамена 3]
           ,[Код предмета 3]
           ,[Оценка 3]
           ,[Средний балл])
     VALUES
(1, '2008-02-01', 1, 5, '2008-02-09', 4, 3, '2008-02-04', 2, 4, 0),
(2, '2008-01-30', 5, 4, '2008-02-23', 3, 5, '2008-02-27', 1, 5, 0),
(3, '2008-01-26', 3, 5, '2008-02-05', 1, 3, '2008-02-15', 5, 3, 0),
(4, '2007-12-26', 2, 3, '2008-01-05', 4, 4, '2008-01-21', 3, 4, 0),
(5, '2008-01-12', 4, 4, '2008-01-18', 5, 4, '2008-01-25', 1, 4, 0),
(6, '2007-12-17', 2, 4, '2007-12-26', 4, 5, '2008-01-05', 1, 3, 0),
(7, '2008-02-21', 5, 2, '2008-02-25', 1, 2, '2008-02-20', 2, 4, 0),
(8, '2008-02-03', 3, 3, '2008-02-12', 5, 3, '2008-02-14', 4, 5, 0),
(9, '2008-01-25', 1, 5, '2008-02-02', 3, 5, '2008-01-23', 5, 5, 0),
(10, '2007-12-28', 4, 4, '2008-01-11', 1, 4, '2008-02-27', 2, 3, 0);

